---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ForgeTypeId Constructor
ForgeTypeId Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | ForgeTypeId()()()() | Constructs a ForgeTypeId holding an empty schema identifier. |
|  | ForgeTypeId(String) | Constructs a ForgeTypeId holding the given schema identifier. |

# See Also

ForgeTypeId Class

ForgeTypeId Members

Autodesk.Revit.DB Namespace